OdRxMember.init(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValueType!System.Runtime.CompilerServices.IsConst*,OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Initialization method used by descendants to assign unlocalized name, type
and owner of this member.

OdRxMember.subChildrenEx(OdArray&lt;OdSmartPtr&lt;OdRxMember&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxMember&gt;&gt;&gt;**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
subChildrenEx allows adding properties in bulk. pChildren array is managed
by the function itself.

OdRxMember.subChildren(OdArray&lt;OdSmartPtr&lt;OdRxMember&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxMember&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
First call to children calls subChildren, if it returned eNotApplicable then
subChildrenEx is called. subChildren() is expected to adds members children
array.

OdRxMember.deleteMember(OdRxMember!System.Runtime.CompilerServices.IsConst*)
\details
This method should be used to delete properties while unloading. It removes
this member from the owner, and fires "goodbye" reactors registered with the
OdRxMemberQueryEngine.
\param pMember [in] Property to be removed.

OdRxMember.children
\details
Some properties may have child properties, e.g. "EndPoint" property of
OdDbLine has subproperties "EndPoint/X", "EndPoint/Y", "EndPoint/Z".
\returns
Array of subproperties (child properties).

OdRxMember.owner
\details
For the usual properties owner is the OdRxClass they are attached to.
For subproperties owner is the main property.
\returns
Owner of the property.

OdRxMember.attributes
\details
Attributes are used on some properties to modify their behaviour. E.g.
OdRxLocalizedNameAttribute defines localName().
See RxAttributes.h for more information.
\returns
Collection of property attributes.
\details
Attributes are used on some properties to modify their behaviour. E.g.
OdRxLocalizedNameAttribute defines localName().
See RxAttributes.h for more information.
\returns
Collection of property attributes.

OdRxMember.type
\details
Property value type.
\returns
Property value type.

OdRxMember.localName
\details
Localized name (can be loaded from resources via OdRxLocalizedNameAttribute::getLocalizedName).
\returns
Localized name of the property.

OdRxMember.name
\details
Static unlocalized name of the property.
\returns
Name of the property.